<div style="float: right; color:red; font-weight:bold;">Rename this file before you work on it!</div>
# Pandas Exercise
Use the Adventure Works dataset to create the following reports. The dataset is availablt for download in it's original format at https://msdn.microsoft.com/en-us/library/hh403424.aspx (follow instructions to download).

## Task
1. write the Python Pandas expression to produce a table as described in the problem statements.
2. The SQL expression may give you a hint. It also allows you to see both systems side-by-side.
3. If you don't know SQL just ignore the SQL code.

In [1]:
import pandas as pd
import numpy as np

In [2]:
%%time
Empoyees = pd.read_excel('/home/data/AdventureWorks/Employees.xls')

CPU times: user 64.4 ms, sys: 5.03 ms, total: 69.4 ms
Wall time: 68.2 ms

In [3]:
%%time
Territory = pd.read_excel('/home/data/AdventureWorks/SalesTerritory.xls')

CPU times: user 9.8 ms, sys: 3.53 ms, total: 13.3 ms
Wall time: 12.1 ms

In [4]:
%%time
Customers = pd.read_excel('/home/data/AdventureWorks/Customers.xls')

CPU times: user 9.16 ms, sys: 509 µs, total: 9.67 ms
Wall time: 8.58 ms

In [5]:
%%time
Orders = pd.read_excel('/home/data/AdventureWorks/ItemsOrdered.xls')

CPU times: user 12.6 ms, sys: 342 µs, total: 13 ms
Wall time: 12 ms

# Filtering (with)

### 1. Provide a list of employees that are married.

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
    WHERE e.MaritalStatus = 'M';

In [9]:
Empoyees.loc[Empoyees.MaritalStatus == 'M', ['EmployeeID', 'FirstName', 'LastName']]

     EmployeeID    FirstName        LastName
0           259          Ben          Miller
1           278      Garrett          Vargas
2           204         Gabe           Mares
3            78       Reuben            D'sa
4           255       Gordon             Hee
10           10      Michael          Raheem
12          175         Reed            Koch
14          144         Paul           Singh
15          192       Brenda            Diaz
18          203          Ken            Myer
19          245      Barbara        Moreland
24          163         Alex         Nayberg
25          118          Don            Hall
26          176        David        Lawrence
27          147       Sandra  Reátegui Alayo
28          138     Samantha           Smith
29           95          Jim       Scardelis
30          231           Jo           Berry
31           86         Ryan       Cornelsen
33          214      Andreas        Berglund
34           72       Steven        Selikoff
36          107  Christopher            Hill
37          269          Dan           Bacon
38          187       Yvonne           McKay
40           12      Thierry          D'Hers
42           30       Britta           Simon
43          198     Lorraine             Nay
45           31       Margie           Shoop
48            3      Roberto      Tamburello
49          199        Paula         Nartker
..          ...          ...             ...
227         136    Sylvester          Valdez
231          35      Brandon      Heidepriem
232         228    Christian      Kleinerman
233         223       Sairaj           Uddin
234         100        Lolan            Song
239         200        Frank             Lee
240         279         Tsvi          Reiter
243          73       Carole          Poland
249          21        Terry       Eminhizer
252         254       Fukiko           Ogisu
255          53        Diane           Glimp
256         282         José         Saraiva
258         209       Kathie           Flood
259          50       Sidney            Higa
261          70        David           Ortiz
264         140     Prasanna  Samarawickrama
266           5         Gail        Erickson
267         252       Arvind             Rao
269         233       Magnus         Hedlund
270          83      Patrick            Cook
272         241        David             Liu
275         239        Mindy          Martin
278          38          Kim     Abercrombie
279         154      Raymond             Sam
280         114    Mindaugas      Krapauskas
281         123        Vamsi           Kuppa
283         101       Houman      Pournasseh
284         221        Chris          Norred
288         289          Jae             Pak
290         999     Chadwick           Smith

[147 rows x 3 columns]

### 2a. Show me a list of employees that have a lastname that begins with "R".

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE 'R%';

In [12]:
Empoyees[['EmployeeID', 'FirstName', 'LastName']].where(Empoyees.LastName.str.startswith("R"))

     EmployeeID FirstName        LastName
0           NaN       NaN             NaN
1           NaN       NaN             NaN
2           NaN       NaN             NaN
3           NaN       NaN             NaN
4           NaN       NaN             NaN
5           NaN       NaN             NaN
6           NaN       NaN             NaN
7           NaN       NaN             NaN
8           NaN       NaN             NaN
9         124.0       Kim           Ralls
10         10.0   Michael          Raheem
11          NaN       NaN             NaN
12          NaN       NaN             NaN
13          NaN       NaN             NaN
14          NaN       NaN             NaN
15          NaN       NaN             NaN
16        166.0      Jack         Richins
17          NaN       NaN             NaN
18          NaN       NaN             NaN
19          NaN       NaN             NaN
20          NaN       NaN             NaN
21          NaN       NaN             NaN
22          NaN       NaN             NaN
23          NaN       NaN             NaN
24          NaN       NaN             NaN
25          NaN       NaN             NaN
26          NaN       NaN             NaN
27        147.0    Sandra  Reátegui Alayo
28          NaN       NaN             NaN
29          NaN       NaN             NaN
..          ...       ...             ...
261         NaN       NaN             NaN
262         NaN       NaN             NaN
263         NaN       NaN             NaN
264         NaN       NaN             NaN
265         NaN       NaN             NaN
266         NaN       NaN             NaN
267       252.0    Arvind             Rao
268         NaN       NaN             NaN
269         NaN       NaN             NaN
270         NaN       NaN             NaN
271         NaN       NaN             NaN
272         NaN       NaN             NaN
273         NaN       NaN             NaN
274         NaN       NaN             NaN
275         NaN       NaN             NaN
276         NaN       NaN             NaN
277         NaN       NaN             NaN
278         NaN       NaN             NaN
279         NaN       NaN             NaN
280         NaN       NaN             NaN
281         NaN       NaN             NaN
282         NaN       NaN             NaN
283         NaN       NaN             NaN
284         NaN       NaN             NaN
285         NaN       NaN             NaN
286         NaN       NaN             NaN
287         NaN       NaN             NaN
288         NaN       NaN             NaN
289         NaN       NaN             NaN
290         NaN       NaN             NaN

[291 rows x 3 columns]

### 2b. Show me a list of employees that have a lastname that ends with "r"

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE '%r';

In [11]:
Empoyees.loc[Empoyees.LastName.str.endswith("r"), ['EmployeeID', 'FirstName', 'LastName']]

     EmployeeID  FirstName      LastName
0           259        Ben        Miller
8           161       Kirk  Koenigsbauer
18          203        Ken          Myer
49          199      Paula       Nartker
53           41      Bryan         Baker
56          104       Mary         Baker
64          225       Alan        Brewer
75          156       Lane    Sacksteder
95           44      Simon        Rapier
97           96  Elizabeth        Keyser
98          229       Lori         Penor
127          39         Ed   Dudenhoefer
129          42      James        Kramer
165         117       Chad     Niswonger
168          57      Frank        Miller
172         105      Kevin         Homer
173         253      Linda       Meisner
196           7      Dylan        Miller
200         183    Barbara        Decker
203         142     Olinda        Turner
216          94    Russell        Hunter
222         273      Brian       Welcker
229         216       Sean     Alexander
240         279       Tsvi        Reiter
249          21      Terry     Eminhizer
254         262      David        Barber
282          29       Mark      McArthur

### 2c. Provide a list of employees that have a hyphenated lastname.

SELECT e.EmployeeID, e.FirstName, e.LastName FROM dbo.Employees AS e
	WHERE e.LastName LIKE '%-%';

### 3a. Provide a list of employees that are on salary and have more than 35 vacation hours left.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 35);

### 3b. Show the same as above but limit it to American employees.

SELECT DISTINCT CountryName FROM dbo.Employees;

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 5) AND e.CountryName = 'United States';

### 3c. Show the same as above but limit it to non-US employees.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE (e.SalariedFlag = 1) AND (e.VacationHours > 5) AND e.CountryName != 'United States';

### 4a. List the married employees with more than 35 vacation hours, only ones living in Washington state.

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.MaritalStatus = 'M' AND e.VacationHours > 35 AND e.StateProvinceName = 'Washington'
	;

### 4b. Change the logic to include anyone who meets any of the 3 conditions (i.e., people who are either married, live in Washington state, or have more than 35 vacation hours left)

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.MaritalStatus
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.MaritalStatus = 'M' OR e.VacationHours > 35 OR e.StateProvinceName = 'Washington'
	;

### 4c. Show the same as above, but only for Production Technicians

SELECT DISTINCT JobTitle FROM dbo.Employees; --- look at job titles

SELECT 	e.EmployeeID
		,e.FirstName
		,e.LastName
		,e.MaritalStatus
		,e.JobTitle
		,e.VacationHours
		,e.SalariedFlag
		,e.StateProvinceName
		,e.CountryName
	FROM dbo.Employees AS e
	WHERE e.JobTitle LIKE 'Production Technician%'
		 AND (e.MaritalStatus = 'M' OR e.VacationHours > 35 OR e.StateProvinceName = 'Washington')
	;

In [15]:
Empoyees.loc[Empoyees.JobTitle.str.lower().startswith('p')]['JobTitle']

AttributeError: 'Series' object has no attribute 'startswith'

### 5a. List all employees living in Redmond, Seattle, and Bellevue, showing EmployeeID, FirstName, LastName, and City. Sort the list alphabetically by city.

SELECT e.EmployeeID, e.FirstName, e.LastName, e.City
	FROM dbo.Employees AS e
	WHERE e.City in ('Redmond', 'Seattle', 'Bellevue')
	ORDER BY e.City
	;

### 5b. For the list above, make sure these are only in the state of Washington, just to be careful.

SELECT DISTINCT e.City, e.StateProvinceName, e.CountryName
	FROM dbo.Employees AS e
	WHERE e.City in ('Redmond', 'Seattle', 'Bellevue')
	;

SELECT e.EmployeeID, e.FirstName, e.LastName, e.City,  e.StateProvinceName
	FROM dbo.Employees AS e
	WHERE e.City in ('Redmond', 'Seattle', 'Bellevue') AND e.StateProvinceName = 'Washington'
	ORDER BY e.City
	;

### 6. Provide a list of employees who have no title, whether it's a NULL or empty string.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName
	FROM dbo.Employees AS e
	WHERE e.Title IS NULL OR e.Title = ''
	;

### 7a. Provide a list of employees who have at least 60 vacation hours left.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours >= 60
	;

### 7b. Provide a list of employees who have less than 60 vacation hours left.

In [ ]:
SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours < 60
	;

### 7c. Show me employees who have more than 20 and less than 60 vacation hours left.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours BETWEEN 21 AND 59
	;

### 7d. If you did not use BETWEEN for 7c, do the same but use BETWEEN. If you did use BETWEEN for 7c, do it another way.

SELECT e.EmployeeID, e.Title, e.FirstName, e.LastName, e.VacationHours, e.SickLeaveHours
	FROM dbo.Employees AS e
	WHERE e.VacationHours > 20 AND  e.VacationHours < 60
	;

# Grouping

### 1a. What is the earliest birthdate for all employees?

SELECT MIN(e.BirthDate) FROM dbo.Employees AS e;

### 1b. Add to the above, the most recent birthdate for all employees

SELECT MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e;

### 1c. Show the above results broken down by gender

SELECT e.Gender, MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e
	GROUP BY e.Gender
	;

### 1d. Show the above results broken down by gender, and salaried/hourly

SELECT e.Gender, e.SalariedFlag, MIN(e.BirthDate) AS 'Earliest Birthday', MAX(e.BirthDate) AS 'Most Reecent Birthday'
	FROM dbo.Employees AS e
	GROUP BY e.Gender, e.SalariedFlag
	;

### 2a. What are the average vacation hours for all employees?

SELECT AVG(e.VacationHours)
	FROM dbo.Employees AS e	
	;

### 2b. Add to the above, the minimum vacation hours for all employees

SELECT AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minumum Vacation'
	FROM dbo.Employees AS e	
	;

### 2c. Show the above results broken down and ordered by job title

SELECT e.JobTitle, AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minimum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle
	;

### 2d. Show the above results broken down by job title, and married/single employees

SELECT e.JobTitle, e.MaritalStatus, AVG(e.VacationHours) AS 'Average Vacation', MIN(e.VacationHours) AS 'Minimum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus
	;

### 2e. Add to the above, the maximum vacation hours per group

SELECT e.JobTitle, e.MaritalStatus
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus
	;

### 2f. Show the above results broken down by job title, married/single employees, and State

SELECT e.JobTitle, e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	GROUP BY e.JobTitle, e.MaritalStatus, e.StateProvinceName
	;

### 2g. Show the above results but only for American employees

SELECT e.JobTitle, e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.JobTitle, e.MaritalStatus, e.StateProvinceName
	;

### 2h. Change the grouping above so it's broken down by married/single and State, no more job title

SELECT e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.MaritalStatus, e.StateProvinceName
	;

### 2i. Limit the results above to States where the average vacation hours is greater than 30

SELECT e.MaritalStatus, e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.MaritalStatus, e.StateProvinceName
	HAVING AVG(e.VacationHours) > 30
	;

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) > 30
	;

### 2j. Limit the results above to States where the average vacation hours is greater than 30 and the maximum vacation hours is less than 50

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName = 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) BETWEEN 31 AND 49
	;

### 2k. Show the same results but only for non-American employees

SELECT e.StateProvinceName
		, AVG(e.VacationHours) AS 'Average Vacation'
		, MIN(e.VacationHours) AS 'Minimum Vacation'
		, MAX(e.VacationHours) AS 'Maximum Vacation'
	FROM dbo.Employees AS e
	WHERE e.CountryName != 'United States'
	GROUP BY e.StateProvinceName
	HAVING AVG(e.VacationHours) BETWEEN 31 AND 49
	;

### 3a. Report how many employees are in the company

SELECT COUNT(1) FROM dbo.Employees;

### 3b. For the above report, show the number of employees per manager (hint: use ManagerID)

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.ManagerID
	;

### 3c. Remove any manager ID's that are NULL from the results above

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	WHERE e.ManagerID IS NOT NULL
	GROUP BY e.ManagerID
	;

### 3d. Show the same results as above, but only for managers who have at least 5 employees

SELECT e.ManagerID, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	WHERE e.ManagerID IS NOT NULL
	GROUP BY e.ManagerID
	HAVING COUNT(1) >= 5
	;

### 4a. List the average vacation hours of all employees

SELECT AVG(e.VacationHours)
	FROM dbo.Employees AS e
	;

### 4b. Break down the results by State

SELECT e.StateProvinceName, AVG(e.VacationHours) AS 'Average Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName
	;

### 4c. Break down the results by city and State

SELECT e.StateProvinceName, e.City, AVG(e.VacationHours) AS 'Average Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	;

### 4d. Add something that shows the number of employees per city

SELECT e.StateProvinceName, e.City
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	;

### 4e. Sort the results by the city and state

SELECT e.StateProvinceName, e.City
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

### 4f. Make city and State a single column in the format of "City, State"

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

### 4g. Add a column that shows the difference between the maximum vacation hours and minimum vacation hours for each city

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY e.StateProvinceName, e.City
	;

### 4h. Now sort the results by the new column created above

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	ORDER BY 'Difference Vacation Hours' DESC
	;

### 4i. Limit the results to cities that have more than 1 employee

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	GROUP BY e.StateProvinceName, e.City
	HAVING COUNT(1) > 1
	ORDER BY 'Difference Vacation Hours' DESC
	;

### 4j. Limit the results to non-U.S. cities

SELECT CONCAT(e.StateProvinceName, ', ', e.City) AS 'Location'
	, AVG(e.VacationHours) AS 'Average Vacation Hours'
	, COUNT(1) AS 'NumEmployees'
	, MAX(e.VacationHours)-MIN(e.VacationHours) AS 'Difference Vacation Hours'
	FROM dbo.Employees AS e
	WHERE e.CountryName != 'United States'
	GROUP BY e.StateProvinceName, e.City
	HAVING COUNT(1) > 1
	ORDER BY 'Difference Vacation Hours' DESC
	;